eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовРаспреденияДоходовРасходов/абс_ИзменениеСтатусовРаспреденияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовРаспреденияДоходовРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходыСводнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_РуководителиБлока/абс_РуководителиБлока.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_РуководителиБлока</name>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРаспределенияДоходовРасходов/абс_СтатусыРаспределенияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРаспределенияДоходовРасходов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВФилиал</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовРаспреденияДоходовРасходов/ManagerModule.bsl
Функция ПолучитьСписокДоступныхСтатусво(СтруктураПараметров, Пользователь, РолиПользователя) Экспорт
	
	ДоступенОтказ       = Истина;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда 
		мТекущийПользователь          = глЗначениеПеременной("глТекущийПользователь");
	Иначе
		мТекущийПользователь = Пользователь;
	КонецЕсли;
	
	Если РолиПользователя = Неопределено Тогда 
		мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	Иначе
		мРолиПользователя = РолиПользователя
	КонецЕсли;
	
	Объект = СтруктураПараметров;
	
	ДоступныеОрганизацииДляОтказа = абс_БизнесПроцессы.ПолучитьДоступныеОрганизацииПоРоли(Справочники.РолиИсполнителей.ОтказПоАвизо,мТекущийПользователь);
	ПользовательРуководительБлока = РегистрыСведений.абс_РуководителиБлока.ПользовательЯвляетсяРуководителемБлока(Объект.ЦФО,мТекущийПользователь);
	ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
	
	РолиДляОтказа = Новый Массив;
	РолиДляОтказа.Добавить(Справочники.РолиИсполнителей.ОтказПоАвизо);
	РолиДляОтказа.Добавить(Справочники.РолиИсполнителей.РуководительБухгалтерскойГруппы);
	
	ДоступенОтказ = абс_БизнесПроцессы.ПолучитьДоступныеОрганизацииПоРоли(РолиДляОтказа,мТекущийПользователь);
		
	Список = Новый Массив;	
	Список.Добавить(Объект.Статус);
	ТекСтатус = Объект.ТекущийСтатус;
	
	Если ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка И мТекущийПользователь = Объект.Ответственный Тогда
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеРуководителемБлока);
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отмена);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеРуководителемБлока И ПользовательРуководительБлока Тогда	
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеДЭФ);
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеДЭФ И мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеДЭФ) <> Неопределено Тогда	
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ОбработкаБухгалтером);
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ);		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ОбработкаБухгалтером И мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Тогда	
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение);
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ);
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Исполнение И мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Тогда	
		
		ОрганизацияКТТК = Справочники.Организации.НайтиПоНаименованию("КТТК");
		
		Если ОрганизацияКТТК <> Объект.Организация Тогда
			Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ);
		Иначе
			Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал);
		КонецЕсли;
		
		Если ДоступенОтказ Тогда
			Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ);
		КонецЕсли;
		
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ Тогда	
		Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Подготовка);
	ИначеЕсли ТекСтатус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВФилиал ИЛИ Объект.Статус = Перечисления.абс_СтатусыРаспределенияДоходовРасходов.ПереводВКЦ Тогда	
		Если ДоступенОтказ Тогда
			Список.Добавить(Перечисления.абс_СтатусыРаспределенияДоходовРасходов.Отказ);
		КонецЕсли;
	КонецЕсли;	

	Возврат Список;
	
КонецФункции

Процедура ЗаписатьНовыйСтатус(Документ, НовыйСтатус, ПричинаИзмененияСтатуса) Экспорт

	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовРаспреденияДоходовРасходов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера();

	Запись.Документ  			= Документ;
	Запись.Пользователь	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.СтатусДокумента  	= НовыйСтатус;
	
	Запись.Комментарий 			= ПричинаИзмененияСтатуса;
	
	НаборЗаписей.Записать();

КонецПроцедуры
